/*
Для решения задач в этом модуле нужно обязательно использовать Stream API.
Задание 1
Для набора случайно сгенерированных целых чисел нужно:
- Количество четных;
- Количество нечетных;
- Количество равных 0;
- Количество равных значению, введенному пользователем.
Задание 2
Для набора названий городов (города могут повторяться) нужно:
- Показать все города;
- Показать все города с названием длиннее шесть символов;
- Посчитать сколько раз встречается город, чье название ввёл пользователь;
- Показать все города, которые начинаются на заданную букву.
Задание 3
Создайте класс «Автомобиля». Он должен хранить информацию о названии
автомобиля, год выпуска, цена, цвет, объем двигателя. Нужно создать
набор автомобилей и выполнить следующие задачи:
Показать все автомобили;
Показать все автомобили заданного цвета;
Показать все автомобили заданного объёма;
Показать все автомобили дороже заданной цены;
Показать все автомобили чей год выпуска находится в указанном диапазоне.
Задание 4
Создайте класс «Телевизор». Он должен хранить информацию о названии модели,
год выпуска, цена, диагональ, производитель. Нужно создать набор телевизоров
и выполнить следующие задачи:
Показать все телевизоры;
Показать телевизоры с заданной диагональю;
Показать все телевизоры одного производителя;
Показать все телевизоры текущего года;
Показать все телевизоры дороже заданной цены;
Показать все телевизоры, отсортированные по цене по возрастанию;
Показать все телевизоры, отсортированные по цене по убыванию;
Показать все телевизоры, отсортированные по диагонали по возрастанию;
Показать все телевизоры, отсортированные по диагонали по убыванию.
*/

public class Main {
    public static void main(String[] args) {
        task1();
        //task2();
        //task3();
        //task4();
    }

    public static void task1() {

    }
}
